# Ultralytics YOLO 🚀, GPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.50  # scales convolution channels

# YOLOv8.0s backbone
backbone:
  # [from, repeats, module, args]
#  - [-1, 1, DWConv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Focus, [64, 3]]  # 0-P1/2
  - [-1, 1, DWConv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, DWConv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 3, CoordAtt, [256]]
  - [-1, 1, DWConv, [512, 3, 2]]  # 6-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 3, CoordAtt, [512]]
  - [-1, 1, DWConv, [1024, 3, 2]]  # 9-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 3, CoordAtt, [1024]]
  - [-1, 1, SPPF, [1024, 5]]  # 12
  - [-1, 3, BoT3,[1024]]  #BOT3 transfomer

# YOLOv8.0s head
head:
#  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
#  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
#  - [-1, 3, C2f, [512]]  # 12
#
#  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
#  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
#  - [-1, 3, C2f, [256]]  # 15 (P3/8-small)
#
#  - [-1, 1, Conv, [256, 3, 2]]
#  - [[-1, 12], 1, Concat, [1]]  # cat head P4
#  - [-1, 3, C2f, [512]]  # 18 (P4/16-medium)
#
#  - [-1, 1, Conv, [512, 3, 2]]
#  - [[-1, 9], 1, Concat, [1]]  # cat head P5
#  - [-1, 3, C2f, [1024]]  # 21 (P5/32-large)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 7], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 15 (P3/8-small)

  - [-1, 1, DWConv, [256, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 18 (P4/16-medium)

  - [-1, 1, DWConv, [512, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 21 (P5/32-large)
  - [-1, 1, GatherExcite, [1024]]

  - [[15, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)
